# -*- coding: utf-8 -*-
# @Time    : 2023/10/20 下午9:37
# @Author  : 顾安
# @File    : 4.while嵌套.py
# @Software: PyCharm

i = 1
y = 1

while i < 3:
    print("安娜老师: 双双咱们去淦饭～")
    print("双双老师: 好呀好呀～")
    print("安娜老师: 那吃什么呢？")
    print("双双老师: 猪蹄YYDS！")
    print("安娜老师: 小心胖三斤...")
    while y <= i:
        print("安娜老师: 哈哈~")
        y += 1
    # print("安娜老师: 哈哈~")
    # print("安娜老师: 哈哈~")
    i += 1


"""
1.内层循环如果条件成立则下一次循环不会执行外层循环而是只执行内层循环中的代码
2.内层循环如果条件不成立则跳到外层循环而不是终止程序
3.如果内层循环条件不成立跳出内层循环并执行外层循环的下一句代码[如果有的话]
"""